<a href="https://colab.research.google.com/github/kghilothia06/Time-Series-Forecasting/blob/main/Counting_Missing_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

EDA

In [2]:
df = pd.read_csv('/content/2000_Customers.csv')

In [3]:
df.head()

   customer_id    Country    size  ... parent_size parent_status1  parent_status2
0     18123858      India   small  ...      medium    Unavailable            CWSW
1     24375238      India  medium  ...      medium    Unavailable            CWSW
2      1138485  Singapore   small  ...      medium    Unavailable            CWSW
3      7256988      India   large  ...      medium    Unavailable            CWSW
4     23859447  Singapore   large  ...      medium    Unavailable            CWSW

[5 rows x 15 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     2000 non-null   int64
 1   Country         2000 non-null   object
 2   size            2000 non-null   object
 3   status1         2000 non-null   object
 4   status2         1088 non-null   object
 5   employees       2000 non-null   int64
 6   score_A1        580 non-null    object
 7   score_HR1       580 non-null    object
 8   score_A         1338 non-null   float64
 9   score_HR        2000 non-null   object
 10  parent_id       2000 non-null   int64
 11  parent_country  1572 non-null   object
 12  parent_size     2000 non-null   object
 13  parent_status1  2000 non-null   object
 14  parent_status2  2000 non-null   object
dtypes: float64(1), int64(3), object(11)
memory usage: 234.5+ KB

In [5]:
df.shape[0]

2000

Declare a dictionary to store the reqd things

In [6]:
Record = dict()

Method to calculate number and percentage of 'Unavailables'

In [7]:
def find_unavailable(column):

  Number_unavailable = 0

  for val in df[column]:

    if str(val) == "Unavailable":

      Number_unavailable = Number_unavailable + 1


  Percentage_unavailable = (Number_unavailable / df.shape[0]) * 100

  return Number_unavailable, Percentage_unavailable

Calculate no. of NULL entries and percentage

In [8]:
for column in df.columns:
  
  #declare a temporary list
  temp_list = []
  
  #Calculate number & percentage of unavailables
  Number_Unavailable, Percentage_Unavailable = find_unavailable(column)

  #Calculate number & percentage of Nulls
  Number_Nulls = df[column].isnull().sum()
  Percentage_Nulls = (Number_Nulls / df.shape[0]) * 100

  temp_list.append(Number_Unavailable)
  temp_list.append(Percentage_Unavailable)  
  temp_list.append(Number_Nulls)
  temp_list.append(Percentage_Nulls)

  Record[column] = temp_list

In [9]:
Record

{'Country': [26, 1.3, 0, 0.0],
 'customer_id': [0, 0.0, 0, 0.0],
 'employees': [0, 0.0, 0, 0.0],
 'parent_country': [24, 1.2, 428, 21.4],
 'parent_id': [0, 0.0, 0, 0.0],
 'parent_size': [0, 0.0, 0, 0.0],
 'parent_status1': [1056, 52.800000000000004, 0, 0.0],
 'parent_status2': [0, 0.0, 0, 0.0],
 'score_A': [0, 0.0, 662, 33.1],
 'score_A1': [2, 0.1, 1420, 71.0],
 'score_HR': [1000, 50.0, 0, 0.0],
 'score_HR1': [2, 0.1, 1420, 71.0],
 'size': [0, 0.0, 0, 0.0],
 'status1': [921, 46.050000000000004, 0, 0.0],
 'status2': [0, 0.0, 912, 45.6]}

Convert to a pandas dataframe

In [10]:
Missing_df = pd.DataFrame.from_dict(Record, orient ='index', columns=['Number_Unavailable', 'Percentage_Unavailable', 'Number_Nulls', 'Percentage_Nulls'])

In [11]:
Missing_df

                Number_Unavailable  ...  Percentage_Nulls
customer_id                      0  ...               0.0
Country                         26  ...               0.0
size                             0  ...               0.0
status1                        921  ...               0.0
status2                          0  ...              45.6
employees                        0  ...               0.0
score_A1                         2  ...              71.0
score_HR1                        2  ...              71.0
score_A                          0  ...              33.1
score_HR                      1000  ...               0.0
parent_id                        0  ...               0.0
parent_country                  24  ...              21.4
parent_size                      0  ...               0.0
parent_status1                1056  ...               0.0
parent_status2                   0  ...               0.0

[15 rows x 4 columns]